In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1': np.random.randn(5),
                    'dataset2': np.random.randn(5)})

In [3]:
dframe

   dataset1  dataset2 k1     k2
0 -0.964365 -0.865312  X  alpha
1 -0.731551  0.345952  X   beta
2  1.271516  0.724099  Y  alpha
3  0.835264  0.621144  Y   beta
4  1.363746  0.226001  Z  alpha

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [5]:
group1.mean()

k1
X   -0.847958
Y    1.053390
Z    1.363746
Name: dataset1, dtype: float64

In [6]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])

In [7]:
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [8]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.731551
    JAN    1.271516
NY  FEB    0.835264
    JAN    0.199691
Name: dataset1, dtype: float64

In [9]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.847958 -0.259680
Y   1.053390  0.672622
Z   1.363746  0.226001

In [10]:
dframe['CITIES'] = cities

In [11]:
dframe['MONTH'] = month

In [17]:
dframe.groupby(['CITIES', 'MONTH'])['dataset1'].mean()

CITIES  MONTH
LA      FEB     -0.731551
        JAN      1.271516
NY      FEB      0.835264
        JAN      0.199691
Name: dataset1, dtype: float64

In [18]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [19]:
dframe

   dataset1  dataset2 k1     k2 CITIES MONTH
0 -0.964365 -0.865312  X  alpha     NY   JAN
1 -0.731551  0.345952  X   beta     LA   FEB
2  1.271516  0.724099  Y  alpha     LA   JAN
3  0.835264  0.621144  Y   beta     NY   FEB
4  1.363746  0.226001  Z  alpha     NY   JAN

In [20]:
for name,group in dframe.groupby('k1'):
    print "This is the %s group" %name
    print group
    print "\n"

This is the X group
   dataset1  dataset2 k1     k2 CITIES MONTH
0 -0.964365 -0.865312  X  alpha     NY   JAN
1 -0.731551  0.345952  X   beta     LA   FEB


This is the Y group
   dataset1  dataset2 k1     k2 CITIES MONTH
2  1.271516  0.724099  Y  alpha     LA   JAN
3  0.835264  0.621144  Y   beta     NY   FEB


This is the Z group
   dataset1  dataset2 k1     k2 CITIES MONTH
4  1.363746  0.226001  Z  alpha     NY   JAN

In [22]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print "Key1 = %s Key2 = %s" %(k1,k2)
    print group
    print "\n"

Key1 = X Key2 = alpha
   dataset1  dataset2 k1     k2 CITIES MONTH
0 -0.964365 -0.865312  X  alpha     NY   JAN


Key1 = X Key2 = beta
   dataset1  dataset2 k1    k2 CITIES MONTH
1 -0.731551  0.345952  X  beta     LA   FEB


Key1 = Y Key2 = alpha
   dataset1  dataset2 k1     k2 CITIES MONTH
2  1.271516  0.724099  Y  alpha     LA   JAN


Key1 = Y Key2 = beta
   dataset1  dataset2 k1    k2 CITIES MONTH
3  0.835264  0.621144  Y  beta     NY   FEB


Key1 = Z Key2 = alpha
   dataset1  dataset2 k1     k2 CITIES MONTH
4  1.363746  0.226001  Z  alpha     NY   JAN

In [24]:
# create a dictionary from a group by
group_dict = dict(list(dframe.groupby('k1')))

In [33]:
group_dict

{'X':    dataset1  dataset2 k1     k2 CITIES MONTH
 0 -0.964365 -0.865312  X  alpha     NY   JAN
 1 -0.731551  0.345952  X   beta     LA   FEB,
 'Y':    dataset1  dataset2 k1     k2 CITIES MONTH
 2  1.271516  0.724099  Y  alpha     LA   JAN
 3  0.835264  0.621144  Y   beta     NY   FEB,
 'Z':    dataset1  dataset2 k1     k2 CITIES MONTH
 4  1.363746  0.226001  Z  alpha     NY   JAN}

In [29]:
# separate the dataframe by the data types
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [30]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.964365 -0.865312
 1 -0.731551  0.345952
 2  1.271516  0.724099
 3  0.835264  0.621144
 4  1.363746  0.226001, dtype('O'):   k1     k2 CITIES MONTH
 0  X  alpha     NY   JAN
 1  X   beta     LA   FEB
 2  Y  alpha     LA   JAN
 3  Y   beta     NY   FEB
 4  Z  alpha     NY   JAN}

In [47]:
for key in group_dict_axis1:
#     print "key: %s , value: %s" % (key, group_dict_axis1[key])
    print key, type(key)
    print group_dict_axis1[key]

object <type 'numpy.dtype'>
  k1     k2 CITIES MONTH
0  X  alpha     NY   JAN
1  X   beta     LA   FEB
2  Y  alpha     LA   JAN
3  Y   beta     NY   FEB
4  Z  alpha     NY   JAN
float64 <type 'numpy.dtype'>
   dataset1  dataset2
0 -0.964365 -0.865312
1 -0.731551  0.345952
2  1.271516  0.724099
3  0.835264  0.621144
4  1.363746  0.226001

In [50]:
key = np.dtype(np.float64)
group_dict_axis1[key]

   dataset1  dataset2
0 -0.964365 -0.865312
1 -0.731551  0.345952
2  1.271516  0.724099
3  0.835264  0.621144
4  1.363746  0.226001

In [51]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.865312
   beta   0.345952
Y  alpha  0.724099
   beta   0.621144
Z  alpha  0.226001